\echo '============================================='
\echo '       УСПЕВАЕМОСТЬ СТУДЕНТА'
\echo '============================================='

\prompt 'Код студента: ' s_id

\echo ''
SELECT 
    СТУДЕНТЫ.фамилия || ' ' || СТУДЕНТЫ.имя AS студент,
    ДИСЦИПЛИНЫ.название AS дисциплина,
    УСПЕВАЕМОСТЬ.оценка,
    УСПЕВАЕМОСТЬ.дата
FROM УСПЕВАЕМОСТЬ
JOIN СТУДЕНТЫ ON СТУДЕНТЫ.код = УСПЕВАЕМОСТЬ.студент
JOIN ДИСЦИПЛИНЫ ON ДИСЦИПЛИНЫ.код = УСПЕВАЕМОСТЬ.дисциплина
WHERE СТУДЕНТЫ.код = :s_id
ORDER BY УСПЕВАЕМОСТЬ.дата DESC;
