\echo '============================================='
\echo '       ДОБАВЛЕНИЕ НОВОЙ ДИСЦИПЛИНЫ'
\echo '============================================='

\prompt 'Название дисциплины: ' name
\prompt 'Количество часов: ' hours
\prompt 'Номер семестра: ' semester

INSERT INTO ДИСЦИПЛИНЫ (название, часы, семестр) 
VALUES (:'name', :hours, :semester);

\echo '============================================='
\echo 'ДИСЦИПЛИНА ДОБАВЛЕНА'
\echo '============================================='

SELECT * FROM ДИСЦИПЛИНЫ ORDER BY код DESC LIMIT 1;
